tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "sass/sass"
tap "supabase/tap"
# Platform built on V8 to build network applications
brew "node"
# Command-line tool for Appwrite
brew "appwrite"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Manage multiple Node.js versions
brew "nvm"
# Command-line interface for Vercel
brew "vercel-cli"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Command-line interface for 1Password
cask "1password-cli", args: { no_quarantine: true }
# Enable Windows-like alt-tab
cask "alt-tab", args: { no_quarantine: true }
# Menu bar icon organiser
cask "bartender", args: { no_quarantine: true }
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac", args: { no_quarantine: true }
# Utilities designed to make common development tasks easier
cask "devtoys", args: { no_quarantine: true }
# Voice and text chat software
cask "discord", args: { no_quarantine: true }
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font", args: { no_quarantine: true }
# Developer targeted fonts with a high number of glyphs
cask "font-fira-mono-nerd-font", args: { no_quarantine: true }
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font", args: { no_quarantine: true }
# Disk space cleaner that finds and deletes duplicated and similar files
cask "gemini", args: { no_quarantine: true }
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2", args: { no_quarantine: true }
# Calculator and converter application
cask "numi", args: { no_quarantine: true }
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian", args: { no_quarantine: true }
# Collaboration platform for API development
cask "postman", args: { no_quarantine: true }
# All-in-one bookmark manager
cask "raindropio", args: { no_quarantine: true }
# Control your tools with a few keystrokes
cask "raycast", args: { no_quarantine: true }
# Team communication and collaboration software
cask "slack", args: { no_quarantine: true }
# Music streaming service
cask "spotify", args: { no_quarantine: true }
# Open-source code editor
cask "visual-studio-code", args: { no_quarantine: true }
# Video communication and virtual meeting platform
cask "zoom", args: { no_quarantine: true }
mas "1Password for Safari", id: 1569813296
mas "Final Cut Pro", id: 424389933
mas "Hand Mirror", id: 1502839586
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Speedtest", id: 1153157709
mas "Things", id: 904280696
mas "Ultra Character Map", id: 520265986
mas "Yubico Authenticator", id: 1497506650
vscode "aaron-bond.better-comments"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme-pro.theme-dracula-pro"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "glenn2223.live-sass"
vscode "gruntfuggly.todo-tree"
vscode "jock.svg"
vscode "mgmcdermott.vscode-language-babel"
vscode "michelemelluso.code-beautifier"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "ritwickdey.liveserver"
vscode "sanity-io.vscode-sanity"
vscode "shakram02.bash-beautify"
vscode "sharat.vscode-brewfile"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "sidthesloth.html5-boilerplate"
vscode "streetsidesoftware.code-spell-checker"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "vunguyentuan.vscode-postcss"
vscode "xabikos.javascriptsnippets"
vscode "xyc.vscode-mdx-preview"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
